src/example/example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejs="http://ejs.com.br">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>ejs</wsse:Username>
                <wsse:Password>123</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <ejs:SaveCustomerDetailRequest>
            <ejs:CustomerDetail>
                <ejs:email>teste@testenest</ejs:email>
                <ejs:name>nest nest</ejs:name>
                <ejs:phone>11111111</ejs:phone>
            </ejs:CustomerDetail>
        </ejs:SaveCustomerDetailRequest>
    </soapenv:Body>
</soapenv:Envelope>